<a href="https://colab.research.google.com/github/ejrtks1020/Bigdata_Analysis_Certification/blob/main/T1_16_%EB%B6%84%EC%82%B0_Expected_Question.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
# 주어진 데이터 셋에서 f2가 0값인 데이터를 age를 기준으로 오름차순 정렬하고
# 앞에서 부터 20개의 데이터를 추출한 후 
# f1 결측치(최소값)를 채우기 전과 후의 분산 차이를 계산하시오 (소수점 둘째 자리까지)

In [ ]:
import pandas as pd

df = pd.read_csv('basic1.csv')

In [ ]:
df = df[df['f2'] == 0]

In [ ]:
df = df.sort_values(by = 'age', ascending = True)

In [ ]:
df.head()

      id  age city     f1  f2   f3    f4         f5
98  id99  1.0   경기   47.0   0  NaN  ESFJ  97.381034
0   id01  2.0   서울    NaN   0  NaN  ENFJ  91.297791
85  id86  2.0   경기    NaN   0  NaN  ESTP  29.269869
56  id57  3.0   대구  111.0   0  NaN  ISFJ  29.269869
90  id91  6.0   경기   72.0   0  NaN  INTP   9.796378

In [ ]:
df = df.head(20)

In [ ]:
before_fillna_var = df['f1'].var()

In [ ]:
before_fillna_var

351.7636363636363

In [ ]:
after_fillna_var = df['f1'].fillna(df['f1'].min()).var()

In [ ]:
round(before_fillna_var - after_fillna_var, 2)

38.44